uhnp/src/Catalogs/ОбластиДанныхВидовОтчетов/ОбластиДанныхВидовОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбластиДанныхВидовОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>АналитикаОтбор</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>EnumRef.ТипыАналитикОбластиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики</name>
    <type>
      <types>EnumRef.ТипыАналитикОбластиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласование</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАналитики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборыАналитки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОбластьГруппа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкОтображения</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВсеПоказателиВидаОтчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БланкиДляОтображения</name>
    <attributes>
      <name>Бланк</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставОбласти</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/РегистрМатрицыПолномочий/РегистрМатрицыПолномочий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрМатрицыПолномочий</name>
  <resources>
    <name>Исполняющий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </resources>
  <resources>
    <name>Исполняющий_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Согласование</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </resources>
  <resources>
    <name>Согласование_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>ШаблонДокументаБД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияРегламентаПодготовкиОтчетности</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ОбластиДанныхВидовОтчетов/Forms/ФормаГруппы/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
		
	РегистрМатрицыПолномочий = РегистрыСведений.РегистрМатрицыПолномочий.СоздатьНаборЗаписей();
    РегистрМатрицыПолномочий.Отбор.ШаблонДокументаБД.Установить(Объект.Ссылка);
	РегистрМатрицыПолномочий.Отбор.ДокументБД.Установить(Справочники.ДокументыБД.НайтиПоНаименованию("РакурсДанных",,,Справочники.ТипыБазДанных.ТекущаяИБ));
	
	мРегистрМатрицыПолномочий = РегистрМатрицыПолномочий.Добавить();
	мРегистрМатрицыПолномочий.ШаблонДокументаБД = Объект.Ссылка;
	мРегистрМатрицыПолномочий.ДокументБД = Справочники.ДокументыБД.НайтиПоНаименованию("РакурсДанных",,,Справочники.ТипыБазДанных.ТекущаяИБ);
	
	мРегистрМатрицыПолномочий.Исполняющий = Объект.Ответственный;
	мРегистрМатрицыПолномочий.Согласование = Объект.Согласование;
	
	РегистрМатрицыПолномочий.Записать(Истина);


КонецПроцедуры
